app/Models/GsbModel.php

    public function get_infos_utilisateur($login, $mdp)
    {
        return $this->db->table('infos_utilisateur')
            ->select('idutilisateur, nom, prenom, login, idrole, libellerole')
            ->where('login', $login)
            ->where('mdp', $mdp)
            ->get()
            ->getRowArray();
---
SELECT `idutilisateur`, `nom`, `prenom`, `login`, `idrole`, `libellerole`
FROM `infos_utilisateur`
WHERE `login` = 'y.b'
AND `mdp` = 'dev123'

    public function get_les_mois_disponibles($idUtilisateur)
    {
        return $this->db->table('infos_fichefrais')
            ->select('CONCAT(annee,mois) AS "anneemois", annee, mois')
            ->where('idutilisateur', $idUtilisateur)
            ->orderBy('annee', 'DESC')
            ->orderBy('mois', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT CONCAT(annee, mois) AS "anneemois", `annee`, `mois`
FROM `infos_fichefrais`
WHERE `idutilisateur` = 'b59'
ORDER BY `annee` DESC, `mois` DESC

    public function get_id_ficheFrais($idUtilisateur, $annee, $mois)
    {
        return $this->db->table('infos_fichefrais')
            ->select('idFiche, idEtat')
            ->where('idutilisateur', $idUtilisateur)
            ->where('annee', $annee)
            ->where('mois', $mois)
            ->get()
            ->getRowArray();
---
SELECT `idFiche`, `idEtat`
FROM `infos_fichefrais`
WHERE `idutilisateur` = 'b59'
AND `annee` = '2025'
AND `mois` = '11'

    public function get_les_infos_ficheFrais($idFiche)
    {
        return $this->db->table('infos_fichefrais')
            ->select('idFiche, idEtat, dateModif, nbJustificatifs, montantValide, libelle')
            ->where('idFiche', $idFiche)
            ->get()
            ->getRowArray();
---
SELECT `idFiche`, `idEtat`, `dateModif`, `nbJustificatifs`, `montantValide`, `libelle`
FROM `infos_fichefrais`
WHERE `idFiche` IS NULL

    public function get_les_frais_forfait($idFiche)
    {
        return $this->db->table('lignefraisforfait')
            ->select('fraisforfait.idfraisforfait, fraisforfait.libelle, lignefraisforfait.quantite')
            ->join('fraisforfait', 'fraisforfait.idfraisforfait = lignefraisforfait.idFraisForfait')
            ->where('lignefraisforfait.idFiche', $idFiche)
            ->orderBy('lignefraisforfait.idFraisForfait', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `fraisforfait`.`idfraisforfait`, `fraisforfait`.`libelle`, `lignefraisforfait`.`quantite`
FROM `lignefraisforfait`
JOIN `fraisforfait` ON `fraisforfait`.`idfraisforfait` = `lignefraisforfait`.`idFraisForfait`
WHERE `lignefraisforfait`.`idFiche` = '394'
ORDER BY `lignefraisforfait`.`idFraisForfait` ASC

    public function get_les_frais_hors_forfait($idFiche)
    {
        return $this->db->table('lignefraishorsforfait')
            ->where('idFiche', $idFiche)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `lignefraishorsforfait`
WHERE `idFiche` = '394'

    public function est_premier_frais_mois($idUtilisateur, $annee, $mois)
    {
        $row = $this->db->table('infos_fichefrais')
            ->select('count(*) AS nblignesfrais')
            ->where('idutilisateur', $idUtilisateur)
            ->where('annee', $annee)
            ->where('mois', $mois)
            ->get()
            ->getRowArray();
---
SELECT count(*) AS nblignesfrais
FROM `infos_fichefrais`
WHERE `idutilisateur` = 'a131'
AND `annee` = '2025'
AND `mois` = '11'

    public function maj_etat_fiche_frais($idFiche, $etat)
    {
        $this->db->table('fichefrais')->update(
            ['idEtat' => $etat, 'dateModif' => date(format: 'Y-m-d')],
            ['idFiche' => $idFiche]
        );
---
UPDATE `fichefrais` SET `idEtat` = 'RB', `dateModif` = '2026-04-10'
WHERE `idFiche` = '394'

    public function get_tous_les_utilisateurs()
    {
        return $this->db->table('utilisateur')
            ->select('idutilisateur, nom, prenom')
            ->where('idrole', 'VS')
            ->orderBy('idutilisateur')
            ->get()
            ->getResultArray();
---
SELECT `idutilisateur`, `nom`, `prenom`
FROM `utilisateur`
WHERE `idrole` = 'VS'
ORDER BY `idutilisateur`

    public function get_fiches_frais_validation($idUtilisateur)
    {
        return $this->db->table('fichefrais')
            ->select('idFiche, idutilisateur, annee, mois, nbJustificatifs, montantValide, dateModif, idEtat')
            ->where('idutilisateur', $idUtilisateur)
            ->where('idEtat', 'VA')
            ->orderBy('idFiche')
            ->get()
            ->getResultArray();
---
SELECT `idFiche`, `idutilisateur`, `annee`, `mois`, `nbJustificatifs`, `montantValide`, `dateModif`, `idEtat`
FROM `fichefrais`
WHERE `idutilisateur` IS NULL
AND `idEtat` = 'VA'
ORDER BY `idFiche`

    public function update_mdp($login, $nvMdp) {
        $majOK = true;
        $res = $this->db->table('utilisateur')->update(
            set: ['mdp' => $nvMdp, 'dernier_changement_mdp' => date('Y-m-d')],
            where: ['login' => $login]
        );
---
UPDATE `utilisateur` SET `mdp` = 'blackyoyoo', `dernier_changement_mdp` = '2026-04-10'
WHERE `login` = 'y.b'